# !/usr/bin/python
# -*- coding: utf-8 -*-
# __author__ = 'wulf'

alphabet = {u'й': 'q', u'ц': 'w', u'у': 'e', u'к': 'r', u'е': 't', u'н': 'y',
            u'г': 'u', u'ш': 'i', u'щ': 'o', u'з': 'p', u'х': '[', u'ъ': ']',
            u'ф': 'a', u'ы': 's', u'в': 'd', u'а': 'f', u'п': 'g', u'р': 'h',
            u'о': 'j', u'л': 'k', u'д': 'l', u'ж': ';', u'э': '\'', u'я': 'z',
            u'ч': 'x', u'с': 'c', u'м': 'v', u'и': 'b', u'т': 'n', u'ь': 'm',
            u'б': ',', u'ю': '.', u'.': '/', u'ё': '`', u'Ё': '~',
            u'Й': 'Q', u'Ц': 'W', u'У': 'E', u'К': 'R', u'Е': 'T', u'Н': 'Y',
            u'Г': 'U', u'Ш': 'I', u'Щ': 'O', u'З': 'P', u'Х': '{', u'Ъ': '}',
            u'Ф': 'A', u'Ы': 'S', u'В': 'D', u'А': 'F', u'П': 'G', u'Р': 'H',
            u'О': 'J', u'Л': 'K', u'Д': 'L', u'Ж': ':', u'Э': '"', u'Я': 'Z',
            u'Ч': 'X', u'С': 'C', u'М': 'V', u'И': 'B', u'Т': 'N', u'Ь': 'M',
            u'Б': '<', u'Ю': '>', u',': '?',
            '!': '!', '"': '@', '№': '#', ';': '$', '%': '%', ':': '^', '?': '&',
            '*': '*', '(': '(', ')': ')', '-': '-', '=': '=', '_': '_', '+': '+'
            }

phrase = u'йцукенгшщзхъ фывапролджэ ячсмитьбю.\nЙЦУКЕНГШЩЗХЪ ФЫВАПРОЛДЖЭ ЯЧСМИТЬБЮ,\n!"№;%:?*()-=ёЁ'
formated_phrase = []

for i in phrase:
    if i in alphabet:
        formated_phrase.append(alphabet.get(i))
    else:
        formated_phrase.append(i)

c = str
d = c.join('', formated_phrase)

print d
